### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.apim.azurerm_api_management_api.messages_api_v1 will be created
  + resource "azurerm_api_management_api" "messages_api_v1" {
      + api_management_name   = "io-p-itn-apim-01"
      + api_type              = (known after apply)
      + description           = "IO Messages - API"
      + display_name          = "IO Messages - API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-itn-messages-api-01"
      + path                  = "api/v1/messages"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-com-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-messages/68a8b247b06206c14c11383089cce4e87d202c15/apps/services-func/openapi/index.yaml"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.apim.azurerm_api_management_api_policy.messages_api_v1 will be created
  + resource "azurerm_api_management_api_policy" "messages_api_v1" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-itn-messages-api-01"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-com-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <choose>
                        <when condition="@(context.User.Groups.Any(g => g.Name == "ApiAuthenticationClientCertificate") && !(context.Request.Headers.GetValueOrDefault("{{apigad-gad-client-certificate-verified-header}}", "false") == "true"))">
                            <return-response>
                                <set-status code="403" reason="Invalid client certificate" />
                            </return-response>
                        </when>
                    </choose>
                    <set-backend-service base-url="https://io-p-itn-com-services-func-01.azurewebsites.net/api/v1" />
                    <set-header name="x-functions-key" exists-action="override">
                        <value>{{io-p-itn-com-services-func-key}}</value>
                    </set-header>
                    <set-header name="x-user-id" exists-action="override">
                        <value>@(context.User.Id)</value>
                    </set-header>
                    <set-header name="x-user-groups" exists-action="override">
                        <value>@(String.Join(",", context.User.Groups.Select(g => g.Name)))</value>
                    </set-header>
                    <set-header name="x-subscription-id" exists-action="override">
                        <value>@(context.Subscription.Id)</value>
                    </set-header>
                    <set-header name="x-user-email" exists-action="override">
                        <value>@(context.User.Email)</value>
                    </set-header>
                    <cors>
                        <allowed-origins>
                            <origin>*</origin>
                        </allowed-origins>
                        <allowed-methods>
                            <method>*</method>
                        </allowed-methods>
                        <allowed-headers>
                            <header>*</header>
                        </allowed-headers>
                        <expose-headers>
                            <header>*</header>
                        </expose-headers>
                    </cors>
                </inbound>
                <outbound>
                    <base />
                </outbound>
                <backend>
                    <base />
                </backend>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.apim.azurerm_api_management_named_value.io_p_itn_com_services_func_key will be created
  + resource "azurerm_api_management_named_value" "io_p_itn_com_services_func_key" {
      + api_management_name = "io-p-itn-apim-01"
      + display_name        = "io-p-itn-com-services-func-key"
      + id                  = (known after apply)
      + name                = "io-p-itn-com-services-func-key"
      + resource_group_name = "io-p-itn-com-rg-01"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.apim.azurerm_api_management_product_api.messages_api_v1 will be created
  + resource "azurerm_api_management_product_api" "messages_api_v1" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-itn-messages-api-01"
      + id                  = (known after apply)
      + product_id          = "io-services-api"
      + resource_group_name = "io-p-itn-com-rg-01"
    }

  # module.web_apps.module.services_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-services-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Comunicazione"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "1.0.1"
            "Source"                                 = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-resource-id" = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```

</details>
